## ------------------------------------------------------------------------ ##
##  .osx/.Brewfile                           Nicholas Berlette, 2022-05-31  ##
## ------------------------------------------------------------------------ ##
##      https://github.com/nberlette/dotfiles/blob/main/.osx/.Brewfile      ##
## ------------------------------------------------------------------------ ##
##              MIT © Nicholas Berlette <nick@berlette.com>                 ##
## ------------------------------------------------------------------------ ##

## generated by the `brew bundle dump` command after installation

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jeroenknoops/tap"
tap "supabase/tap"
tap "superfly/tap"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Network authentication protocol
brew "krb5"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Pack, ship and run any application as a lightweight container
brew "docker"
# CLI application for interacting with a Cloudflare account
brew "flarectl"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Library for manipulating fonts
brew "fonttools", link: false
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg", link: false
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Lightweight and flexible command-line JSON processor
brew "jq"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Rainbows and unicorns in your console!
brew "lolcat"
# Utility for directing compilation
brew "make"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network grep
brew "ngrep"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Generic syntax highlighter
brew "pygments", link: false
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# commit/branch/workdir explorer for git
brew "jeroenknoops/tap/gitin"
# Supabase CLI
brew "supabase/tap/supabase"
brew "superfly/tap/flyctl"
# Server and cloud storage browser
cask "cyberduck"
# Web browser
cask "firefox"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code"
cask "font-oswald"
# Font editor and converter for outline and bitmap fonts
cask "fontforge"
# Web browser
cask "google-chrome"
# Tools to protect your emails and files
cask "gpg-suite"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# Visual database editor for Prisma projects
cask "prisma-studio"
# VPN client
cask "private-internet-access"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# Open-source code editor
cask "visual-studio-code"
